Repository: gamunax/lol-senpai
Catalog: server/translations/*/LC_MESSAGES/messages.po
Languages: fr

source: Home
fr: Accueil

source: About
fr: A propos

source: %(summoner)s's match
fr: Match de %(summoner)s

source: Summoner not found
fr: Invocateur introuvable

source: This summoner doesn't exist in this region.
fr: Cet invocateur n'existe pas dans cette région.

source: Game not found
fr: Partie introuvable

source: This summoner is not in game.
fr: Cet invocateur n'est pas en jeu.

source: Game mode not compatible
fr: Mode de jeu non compatible

source: Lol-Senpai works only for ranked games.
fr: Lol-Senpai fonctionne uniquement pour les parties classées.

source: Server error
fr: Erreur du serveur

source: Unable to connect to the Riot's API.
fr: Impossible de se connecter au serveur de données.

source: Rate limit exceeded
fr: Nombre de requêtes trop important

source: Rate limit exceeded. :( Could you please try again in a few moments?
fr: Nous recevons trop de sollicitations pour le moment. Veuillez réessayer dans quelques instants.

source: Error Riot's API
fr: Problème serveur

source: Error with the Riot's API.
fr: Impossible de récupérer les données sur les serveurs de jeu.

source: Internal server error
fr: Erreur interne

source: Unknown error. :( Could you please try again in a few moments?
fr: Erreur inconnue du serveur. :( Pouvez-vous recommencer dans quelques instants ?

source: The <span class="info enemy">enemy %(champion)s</span> is on a %(loss)d losing streak.
fr: L'<span class="info enemy">ennemi %(champion)s</span> a perdu %(loss)d parties de suite.

source: Some players are prone to tilt and cannot think straight after a losing streak. Try to focus them and take them down to ensure an easier win.
fr: Certains joueurs ont tendance à abandonner plus facilement après une suite de défaites. Essayer de se concentrer sur eux pourrait vous assurer une victoire plus facile.

source: The <span class="info enemy">enemy %(champion)s</span> is on a %(wins)d winning streak.
fr: L'<span class="info enemy">ennemi %(champion)s</span> a gagné %(wins)d parties de suite.

source: A winning streak provides a boost of confidence.
fr: Une série de victoires fournit un élan de confiance.

source: The <span class="info enemy">enemy %(champion)s</span> does not ward a lot. He places %(wards_per_game)d wards per game on average.
fr: L'<span class="info enemy">ennemi %(champion)s</span> n'utilise que très peu de wards. Il place en moyenne %(wards_per_game)d wards par game.

source: Vision is everything. A poor ward coverage means that this enemy is easier to gank and cannot properly control objectives (dragon, nashor). They are in the dark most of the time.
fr: La vision est très importante. Une faible couverture de wards signifie que cet ennemi est plus facile à gank et ne peut pas contrôler correctement les objectifs (dragon, nashor). Ils sont la plupart du temps dans l'obscurité.

source: The <span class="info enemy">enemy %(champion)s</span> has never played this champion before.
fr: L'<span class="info enemy">ennemi %(champion)s</span> n'a jamais joué ce champion avant.

source: The <span class="info enemy">enemy %(champion)s</span> is good with this champion (%(percent_win).1f%% win ratio with %(kda).1f KDA over %(played)d games).
fr: L'<span class="info enemy">ennemi %(champion)s</span> est bon avec ce champion (%(percent_win).1f%% de win ratio avec %(kda).1f de KDA sur %(played)d parties).

source: He has already done %(penta_kills)d penta kills with it
fr: Il a déjà fait %(penta_kills)d penta kills avec ce champion.

source: The <span class="info enemy">enemy %(champion)s</span> is not very good with this champion (%(percent_win).1f%% win ratio with %(kda).1f KDA over %(played)d games).
fr: L'<span class="info enemy">ennemi %(champion)s</span> n'est pas très bon avec ce champion (%(percent_win).1f%% de win ratio avec %(kda).1f de KDA sur %(played)d parties).

source: The <span class="info enemy">enemy %(champion)s</span> probably mains <span class="info enemy">%(role)s</span>.
fr: L'<span class="info enemy">ennemi %(champion)s</span> joue principalement <span class="info enemy">%(role)s</span>.

source: The <span class="info enemy">enemy %(champion)s</span> left a ranked game recently
fr: L'<span class="info enemy">ennemi %(champion)s</span> a récemment quitté une partie classée.

source: The <span class="info enemy">enemy %(champion)s</span> is in a promotion series.
fr: L'<span class="info enemy">ennemi %(champion)s</span> est en série de promotion.

source: The <span class="info ally">allied %(champion)s</span> is good with this champion (%(percent_win).1f%% win ratio with %(kda).1f KDA over %(played)d games).
fr: L'<span class="info ally">allié %(champion)s</span> est bon avec ce champion (%(percent_win).1f%% de win ratio avec %(kda).1f de KDA sur %(played)d parties).

source: The <span class="info ally">allied %(champion)s</span> is on a %(wins)d winning streak.
fr: L'<span class="info ally">allié %(champion)s</span> a gagné %(wins)d victoires de suite.

source: The <span class="info ally">allied %(champion)s</span> is in a promotion series.
fr: L'<span class="info ally">allié %(champion)s</span> est en série de promotion.

source: Does Riot allow it?
fr: Est-ce que Riot autorise cette application ?

source: Yes, this application was created during the April 2015 API Challenge Contest. It complies to the terms and conditions of use.
fr: Oui, cette application a été créée au cours du concours "April 2015 API Challenge Contest", par Riot. Il est conforme aux conditions d'utilisation du service.

source: It's worth mentioning that Lol Senpai isn’t endorsed by Riot Games and doesn’t reflect the views or opinions of Riot Games or anyone officially involved in producing or managing League of Legends. League of Legends and Riot Games are trademarks or registered trademarks of Riot Games, Inc. League of Legends © Riot Games, Inc.
fr: Il est important de mentionner que Lol Senpai n'est pas approuvé par Riot Games et ne reflète pas les vues ou les opinions de Riot Games ou quelqu'un officiellement impliquée dans la production ou la gestion de League of Legends. League of Legends et Riot Games sont des marques commerciales ou des marques déposées de Riot Games, Inc. League of Legends © Riot Games, Inc.

source: Who are we?
fr: Qui sommes nous ?

source: We are both young guys living in Nancy, France:
fr: Nous sommes deux jeunes hommes vivant à Nancy, en France :

source: We love to build applications from the ground up, coding is our daily job.
fr: Nous aimons créer des applications à partir de rien, la programmation est notre travail quotidien.

source: We love to play league of legends and watch pro games. We have been playing for years and one of us even flew all the way to Seoul last October to attend the world finale!
fr: Nous aimons jouer League of Legends et regarder les matchs pro. Nous avons joué pendant des années et l'un de nous a même volé jusqu'à Séoul en octobre dernier pour assister à la finale mondiale !

source: Aurélien at a Lol LAN Party with his team (the guy at the far left), February 2015:
fr: Aurélien à un tournoi de LoL avec son équipe (le gars tout à gauche), en Février 2015 :

source: Alexandre in Sangam Stadium, Seoul for the S04 world championship finale, with Snoopeh, October 2014:
fr: Alexandre à Sangam Stadium, Seoul pour les S04 world championship finale, avec Snoopeh, Octobre 2014 :

source: Why did we decided to participate and how did we come up with this idea?
fr: Pourquoi avons-nous décidé de participer et comment sommes-nous arrivés à cette idée ?

source: We did not think twice when we heard we had the opportunity to combine those 2 passions (coding and League of Legends).
fr: Nous n'y avons pas réfléchis à deux fois lorsque l'on a eu l'opportunité de combiné nos 2 passions.

source: We just had to find an idea. As competitors (one of us reached diamond last season), during the loading screen, we usually gather scraps of information from different sites and try to evaluate our opponents strength and foresight the game plan. We thought it could be nice to have all the important information delivered on a silver plate.
fr: Nous avons juste eu à trouver une idée. Comme tous les compétiteurs (l'un de nous était diamant la saison dernière), au cours de l'écran de chargement, nous rassemblons habituellement quelques d'informations provenant de différents sites et tentons d'évaluer la force de notre adversaire et de définir le plan de match. Nous avons pensé qu'il pourrait être agréable d'avoir toutes les informations importantes livrées sur un plateau d'argent.

source: As we use a lot of tools from the community, we thought that it was a good opportunity to share a tool of our own.
fr: Comme nous utilisons beaucoup d'outils de la communauté, nous pensons que c'était un service utile à proposer.

source: Why is our submission completely off-topic?
fr: Pourquoi notre rendu est complètement hors-sujet ?

source: On April 16, 2015, we realized that our application was off-topic for this contest.
fr: Le 16 Avril 2015, nous avons réalisé que notre demande était hors-sujet pour ce concours.

source: The explanation is quite simple. We (wrongly) mainly relied on this <a href="http://www.riotgames.com/articles/20150330/1661/fyi-our-first-api-challenge">page</a> and on the fact that our entry was accepted to think that we had a chance to compete.
fr: L'explication est assez simple. Nous nous sommes appuyés (à tort) principalement sur cette <a href="http://www.riotgames.com/articles/20150330/1661/fyi-our-first-api-challenge">page</a> ; ainsi que sur le fait que notre inscription ait été acceptée, nous pensions que nous avions une chance de concourir.

source: While in fact, we had to code something related to URF and the new api. It was our fault for not properly reading the rules. It was too late to adapt our concept and we did not want to throw away our work so here we are.
fr: Alors qu'en fait, nous aurions dû coder quelque chose lié au mode URF et à la nouvelle API. Notre faute a été de ne pas correctement lire les règles. Il était trop tard pour adapter notre concept et nous ne voulions pas jeter notre travail.

source: Information about the technical stack and related choices
fr: Informations à propos des choix techniques

source: This contest was the opportunity for us to learn and experiment new technologies.
fr: Ce concours a été l'occasion pour nous d'apprendre et d'expérimenter de nouvelles technologies.

source: Back-end technologies
fr: Technologies Back-end

source: We chose python for our backend technology, along with the Flask framework. It’s a blazing fast and light plugin allowing us to handle basic routing and http requests. it also includes the Jinja2 templating language.
fr: Nous avons choisis de faire notre backend en Python, avec le framework Flask. C’est un plugin léger, qui permet de faire des sites internet, avec gestion des routes, des requêtes HTTP, des templates (via Jinja2), … de manière relativement simple et propre.

source: League of legends is a world-class game. It was obvious that the i18n support was mandatory in order to reach a lot of players. For the sake of the demo, we only implemented the english and french language.
fr: League of Legends est un jeu international. Le support i18n est donc obligatoire afin de pouvoir s'adresser au plus grand nombre de joueurs possibles. Pour ce concours, nous aurons seulement le temps d'implémenter les langues françaises en anglaises.

source: We rely on gettext through the Flask-Babel plugin and use Poedit to handle .po/.mo files.
fr: Nous utilisons pour cela GetText avec le plugin Flask-Babel et Poedit pour générer les fichiers .po/.mo.

source: Having a cache system is essential to avoid querying Riot’s server too much. Python dict/list are not persistent if the server crash so we chose not to use them.
fr: Avoir un système de cache est essentiel pour éviter de faire trop de requêtes sur les serveur de Riot. Les dictionnaires ou listes en Python ne sont pas persistants si le serveur crash, nous avons donc choisis de nous tourner vers autre chose.

source: Instead we chose to store response FROM the API in the key-value cache store Redis, a NoSQL DB. In Lol-Senpai, the key is the URL and the value is the HTTP response (body).
fr: Nous avons en effet décidé de stocker les réponses de l'API dans un système de clé-valeur, Redis, une base de données NoSQL. Sur Lol-Senpai, la clé est l'URL, et la valeur est le contenu de la réponse HTTP.

source: The caching strategy is very simplistic at the moment:
fr: Notre stratégie de cache est très simple pour le moment :

source: 15 min by default
fr: 15 minutes par défaut

source: 1 week for static data (champions info for instance) or summoner ids
fr: Une semaine pour les données statiques (les informations sur les champions par exemple), ou sur les ID des invocateurs.

source: Few minutes for current games
fr: Quelques minutes pour récupérer le match en cours d'un joueur

source: The aim is to rely on the cache as much as possible.
fr: Le but est de s'appuyer sur le cache autant que possible.

source: We are also considering storing long term information on our server. Using NoSQL technologies (maybe MongoDB), to provide more information and data for other modes and not only ranked mode.
fr: Nous envisageons également de stocker des informations à long terme sur notre serveur. À l'aide de technologies NoSQL (peut-être MongoDB), de fournir plus de renseignements et de données pour d'autres modes de jeu et pas seulement sur les parties classées.

source: Hosting technologies
fr: Technologies d'hébergements

source: In order to install, configure and launch these technologies on our server, we chose Docker. It allows us to automate every steps of the build.
fr: Pour installer, configurer et lancer ces technologies sur notre serveur, nous avons choisi la technologie Docker. Il nous permet d'automatiser toutes les étapes de l'installation et la configuration du système.

source: Our flask application runs on nginx (web server). Unfortunately nginx (contrary to apache) does not support WSGI and thus cannot communicate with flask. That’s why Gunicorn comes into play, to act as an interface between our application and the web server.
fr: Notre application Flask s'exécute sur nginx (serveur web). Nginx (contrairement à apache) ne prend pas en charge le WSGI et donc ne peut pas communiquer avec Flask directement. C'est à ce moment que Gunicorn arrive en jeu, pour servir d'interface entre notre application et le serveur web.

source: Finally Supervisor monitor and control Gunicorn.
fr: Enfin, Supervisor surveille et contrôle Gunicorn.

source: At the moment, we are hosting Lol Senpai on a cheap VPS. This is enough for now but this won’t hold the charge if we ever get a small traffic. The next step is going to be the transfer on DigtalOcean who offers nice ssd servers for a cheap price.
fr: Actuellement, nous hébergeons Lol Senpai sur un VPS pas cher. Cela suffit pour l'instant, mais cela ne tiendra pas la charge si nous jamais nous obtenions un petit trafic. La prochaine étape va être le transfert de l'application sur DigitalOcean, qui propose des serveurs SSD agréables pour un prix dérisoire.

source: Regarding our architecture, hopefully, it’s going to be multi-servers. We are going to use:
fr: Au sujet de notre architecture, si tout va bien, nous aurons plusieurs serveurs. Nous allons utiliser :

source: HAProxy (acting as a load balancer)
fr: HAProxy (afin de répartir la charge)

source: Redis sentinel for redis replication
fr: Redis sentinel pour la réplication de Redis

source: With this architecture, we believe that this would allow us to add new servers easily if we ever need to. And of course, we would need better servers and would migrate to AWS or OVH.
fr: Avec cette architecture, nous pensons que cela nous permettrait d'ajouter de nouveaux serveurs facilement si nous en avions l'utilité. Et bien sûr, si jamais nous avons besoin de serveurs encore plus puissants, nous migreront vers des plateformes plus performantes telles que AWS ou OVH.

source: Like every developers these days, we use a CVS to work as a team. We chose git because it’s really powerful (despite not using branches for this contest haha).
fr: Comme tous les développeurs ces jours-ci, nous utilisons un CVS pour travailler en équipe. Nous avons choisi git parce qu'il est vraiment très puissant (en dépit de ne pas utiliser des branches pour ce concours haha).

source: Front-end technologies
fr: Technologies Front-end

source: Finally, regarding the frontend side we used HTML5/CSS3 with a little bit of javascript. We love front-end technologies and we use nice stack on our daily job (bower, grunt, angularJS, sass, etc) but we decided to keep the frontend side as light as possible.
fr: Enfin, concernant le côté fron-tend, nous avons utilisé HTML5/CSS3 avec un peu de javascript. Nous aimons les technologies front-end et nous en utilisons pas mal dans notre travail quotidien (bower, grunt, angularJS, sass, etc.), mais nous avons décidé de garder le côté front-end aussi léger que possible.

source: We chose swiftness and handmade code over libraries. The website is responsive and aimed to be used on mobile (as small as 320px width). Mobile connections are not reliable and we wanted to avoid the load of hundred of ko of libraries.
fr: Nous avons choisi la rapidité et le code à la main que d'utiliser des bibliothèques. Le site est réactif et est destiné à être utilisé sur mobiles (jusqu'à une largeur de 320px). Les connexions mobiles n'étant pas fiables, nous voulions éviter la charge de centaines de ko de bibliothèques.

source: The faster we deliver, the happier the user is.
fr: Plus vite nous livrons, heureux est l'utilisateur.

source: Contact us
fr: Nous contacter

source: You think that we should add an important information or you have any suggestion regarding this service ? Don't hesitate to contact us at <strong>contact at lol-senpai.com</strong> (English or French only).
fr: Vous pensez que nous devrions ajouter une information importante, ou vous avez des suggestions concernant ce service ? N'hésitez pas à nous contacter à <strong>contact at lol-senpai.com</strong> (anglais ou français seulement).

source: Final word
fr: Finale mondiale

source: Thank you Riot for giving us the opportunity to use your data to build tools for the community. You have been keeping us entertain for years. ^_^
fr: Merci à Riot pour nous offrir la possibilité d'utiliser vos données pour construire des outils pour la communauté. Vous nous faites kiffer depuis des années. :)

source: ENGLISH
fr: ANGLAIS

source: FRENCH
fr: FRANCAIS

source: Search
fr: Recherche

source: What is LoL Senpai?
fr: Qu'est-ce que LoL Senpai ?

source: LoL Senpai is a tool aiming to support ranked players in the video game League of legends. It provides advices about the upcoming ranked game and your opponents.
fr: LoL Senpai est un outil qui permet de vous aidez pour vos parties classées dans League of Legends. Il vous conseille en fonction des précédentes parties classées de vos adversaires.

source: Gathering info about your enemy by hand is a tedious process that you cannot always achieve within the limited time of the loading screen.
fr: Récupérez vous-même des informations sur votre ennemi est un processus fastidieux, que vous ne pouvez pas toujours obtenir dans le temps limité de l'écran de chargement.

source: LoL Senpai acts as a mini-coach and tell you what are the key information about the upcoming game.
fr: LoL Senpai agit comme un mini-coach et vous dit quelles sont les informations clés que vous devez savoir pour le match à venir.

source: Which kind of info do you provide?
fr: Quels genres d'informations fournissez-vous ?

source: We put emphasis on the enemy's weaknesses and on your team's strengths, leaving out weaknesses about your own team. The reason behind that is that we want to put you in a positive mindset.
fr: Nous mettons l'accent sur les faiblesses de l'ennemi et la force de votre équipe, en laissant donc les faiblesses au sujet de votre propre équipe de côté. Nous voulons en fait vous mettre dans un état d'esprit positif.

source: Information provided concern, but are not limited to:
fr: Quelques exemples des types d'informations fournies :

source: Strength with a champion or on a specific role
fr: Force avec un champion ou un rôle spécifique

source: Wards coverage
fr: Utilisation des wards

source: Suitability of runes
fr: Pertinence des runes

source: Winning/Losing streaks
fr: Suite de victoires/défaites

source: And much more
fr: Et plus encore

source: Who can benefit from these information?
fr: Qui peut bénéficier de ces informations ?

source: Basically, every summoner interested in the ranked mode can benefit from these information.
fr: Fondamentalement, chaque joueur intéressé par les parties classés peut tirer avantage de ces informations.

source: However, we believe that high ranked players (starting from mid diamond and above) would not find this tool as useful as other players.
fr: Cependant, nous pensons que les joueurs à haut niveau (à partir de diamant 3 / diamant 4) ne trouveront pas cet outil aussi utile que d'autres.

source: Additionally, each information is provided with an optional description, helping out players to interpret it.
fr: Au passage, chaque information est fournie avec une description aidant les joueurs à l'interpréter.

source: What's next?
fr: Et ensuite ?

source: 17 days was a small window to create something meaningful and we could not implement everything that we have imagined. Hopefully, the next updates will concern the following matters.
fr: 17 jours a été une petite fenêtre pour créer quelque chose de significatif, et nous n'avons pas pu réaliser tout ce dont nous avons imaginé. J'espère que les prochaines mises à jour concernent les questions suivantes.

source: Improve the performance of our application and servers
fr: Améliorer les performances de nos applications et serveurs

source: We know that the site is really slow at the moment and we are working on it.
fr: Nous savons que le site est assez lent en ce moment et nous travaillons là-dessus.

source: More description related to advices
fr: Plus de descriptions associées aux conseils

source: Right now, descriptions related to advices are incomplete.
fr: Actuellement, les descriptions associées aux conseils sont incomplètes.

source: Information about runes
fr: Informations à propos des runes

source: We did not even scratch the surface of what we want to achieve with runes. Ideally, we would like to warn summoners about:
fr: Nous n'avons même pas rayer la surface de ce que nous voulions atteindre avec les runes. Idéalement, nous aimerions avertir les invocateurs pour :

source: Plain wasted runes (mana regen/energy regen on champ who does not need it)
fr: Runes inutiles (regen mana / regen d'énergie sur des champions qui n'en ont pas besoin)

source: Sub optimal runes (player running tier1/tier2 runes or pages with incomplete rune pages)
fr: Runes sous-optimales (joueur qui utilise des runes tier1/tier2, ou des pages avec des runes inachevées)

source: Questionable runes (Fiddle jungle running ad runes or no armor runes when the opposite team is full ad comp)
fr: Runes douteuses (fiddle jungler avec des runes AD, ou pas de runes d'armure quand l'équipe en face à une composition full AD)

source: Cheesy runes (a riven running a full ad page is dangerous and is something we should warn the player about)
fr: Cheesy runes (une Riven avec une page full AD est dangereux et c'est quelque chose que nous devrions avertir le joueur concerné)

source: Persistent storage of information for a ‘machine learning'
fr: Stockage persistant de l'information pour une « machine learning »
