Repository: gamunax/lol-senpai
Catalog: server/translations/*/LC_MESSAGES/messages.po
Languages: fr

source: For this contest, we only provided information using on the fly data. We could go much further.
fr: Pour ce concours, nous avons seulement utilisé des données récupérées à la volée. Nous pourrions aller beaucoup plus loin.

source: For the instance we could imagine giving detailed info about a specific upcoming matchup within the elo range of the player based on historical data on a given patch.
fr: Pour l'exemple, on peut imaginer donner des informations détaillées sur un affrontement à venir, spécifique au sein d'un groupe d'elo de joueurs, basées sur les données historiques sur un patch donné.

source: The elo range thing is really important to us, there is no point of telling a silver player that Vayne top played a certain way is really strong versus some champions when it’s only a diamond+ thing and really hard to execute.
fr: Se concentrer sur la plage d'elo du joueur est vraiment important pour nous. Il n'y a, par exemple, aucun intérêt à mentionner à un joueur silver que Vayne top, jouée d'une certaine manière, est vraiment forte contre certains champions quand c'est en réalité un pick de niche à très haut elo et que c'est dur à exécuter.

source: Most counter champion sites are only based on votes from the community. This is not accurate.
fr: La plupart des sites qui propose des counters champion reposent uniquement sur les votes de la communauté. Ce qui n'est pas exact.

source: What if we could query tons of match history to determine the real outcome of a matchup and power spikes of each champion using real, meaningful data for the player?
fr: Imaginez que nous puissions récupérer les données d'une tonne de matchs pour déterminer les moments clés et l'issu d'un matchup en utilisant des données réelles et significatives pour le joueur.

source: These data could also be useful to determine a viable builder order.
fr: Ces données pourraient également être utiles pour déterminer un ordre de build viable.

source: We could also imagine to evaluating the strength of each team based on their composition and give a game plan like a coach would do.
fr: Nous pourrions aussi imaginer d'évaluer la force de chaque équipe basée sur leur composition et donner un plan de jeu comme le ferait un entraîneur.

source: "Ok guys, you have an early comp, you should try push your advantages to end it because their Nasus and Cassiop are going to rip you apart past the 35min mark. Your Lee sin is proven to be a strong ganker, try to focus on toplane to shut Nasus down".
fr: "Ok les gars, vous avez une composition early, vous devriez essayer d'utiliser vos avantages pour y mettre fin, car leurs Nasus et Cassiop risque de vous éclatez au-delà de la 35ième minute. Votre Lee sin s'est avéré être un ganker fort, essayez de mettre l'accent sur la toplane afin de mettre Nasus au fond".

source: This kind of thing is obvious to high ranked players, but could really help bronze/silver players to step up their games and climb faster.
fr: Ce genre de choses est évident pour les joueurs de haut niveau, mais il pourrait vraiment aider les joueurs bronze/argent à intensifier leurs jeux et s'améliorer plus rapidement.

source: No data
fr: Aucune donnée

source: More information
fr: Plus d'informations

source: Good news
fr: Bonnes nouvelles

source: Watch out
fr: Méfiez-vous

source: Search an in-game summoner...
fr: Rechercher un invocateur ...
